[
    {
        "id": "kasa",
        "image": "/images/Kasa.webp",
        "imageDesktop": "/images/kasa-desktop.webp",
        "imageMobile": "/images/kasa-mobile.webp",
        "alt": "interface du site Kasa",
        "title": "Kasa",
        "git": "https://github.com/Flow2510/Kasa",
        "tags": ["REACT", "SCSS", "Responsive", "Figma", "Openclassrooms"],
        "titleDescription": "Description",
        "description": "Le projet Kasa consiste à développer une application front-end en React à partir d'une maquette Figma. \nL'application affiche des annonces immobilières dynamiques, fournit une page de détail par logement avec galerie d'images, tags, système de notation et sections déroulantes pour la description et les équipements. \nLe site est pensé mobile-first, respecte les règles d'accessibilité et utilise React Router pour le routage dynamique. \nCompétences mobilisées : découpage en composants réutilisables, gestion d'état, routage dynamique, intégration depuis une maquette et optimisation responsive."
    },
    {
        "id": "argentbank",
        "image": "/images/argentbank.webp",
        "imageDesktop": "/images/argentbank-desktop.webp",
        "imageMobile": "/images/argentbank-mobile.webp",
        "alt": "une plante pousse sur un tas de pièces",
        "title": "ArgentBank",
        "git": "https://github.com/Flow2510/ArgentBank",
        "tags": ["REACT", "API REST", "SCSS", "Responsive", "Figma", "Openclassrooms"],
        "titleDescription": "Description",
        "description": "Le projet ArgentBank consiste à concevoir la partie front-end d'une application bancaire en React. \nL'objectif est d'intégrer un tableau de bord utilisateur permettant la consultation et la gestion de comptes à partir d'une API REST existante. \nLe projet met l'accent sur l'authentification, la gestion du state global avec Redux, et l'échange de données via des requêtes asynchrones. \nL'application comprend une page de connexion sécurisée, un profil utilisateur avec modification des informations, et une présentation des comptes. \nL'ensemble est réalisé selon une architecture modulaire et responsive, en respectant la maquette Figma fournie."
    },
    {
        "id": "Portfolio",
        "image": "/images/portfolio.webp",
        "imageDesktop": "/images/portfolio-desktop.webp",
        "imageMobile": "/images/portfolio-mobile.webp",
        "alt": "interface de mon site portfolio",
        "title": "Portfolio personnel",
        "git": "https://github.com/Flow2510/portfolio2",
        "tags": ["React", "SCSS", "JavaScript", "Responsive", "ReactRouter", "UX/UI", "Animations", "Design"],
        "titleDescription": "Description",
        "description": "Mon site personnel a été conçu comme une vitrine professionnelle pour présenter mon parcours, mes réalisations et mes compétences en développement front-end. \nLe projet repose sur React pour la structure du contenu, React Router pour la navigation entre les pages, et SCSS pour une gestion claire et modulaire des styles. \nLe design met l’accent sur la lisibilité, la fluidité des transitions et l’accessibilité, avec une mise en page responsive adaptée à tous les écrans. \nCe projet illustre ma capacité à concevoir une application complète, de la conception du design à l’intégration technique, en passant par la gestion des animations et de l’expérience utilisateur."
    },
    {
        "id": "724events",
        "image": "/images/724events.webp",
        "imageDesktop": "/images/724events-desktop.webp",
        "imageMobile": "/images/724events-mobile.webp",
        "alt": "interface du site 724events",
        "title": "724 events",
        "git": "https://github.com/Flow2510/Debuggez-une-application-React.JS",
        "tags": ["REACT", "Redux", "API REST", "Debugging", "SCSS", "Responsive", "Openclassrooms"],
        "titleDescription": "Description",
        "description": "Le projet 724 Events consiste à reprendre et corriger le code d'une application interne destinée à la gestion d'événements d'entreprise. \nDéveloppée en React avec Redux pour la gestion du state, l'application permet d'afficher, filtrer et gérer des événements à partir d'une API REST. \nL'objectif du projet est d'identifier et corriger les bugs existants, d'optimiser la structure du code, et d'améliorer les performances et la maintenabilité. \nUne attention particulière est portée à la compréhension du flux de données Redux, à la gestion des actions et reducers, et à la qualité du code selon les bonnes pratiques front-end. \nCe projet met en avant les compétences en débogage, en optimisation d’applications React, et en travail sur un code existant."
    },
    {
        "id": "sunnyside",
        "image": "/images/sunnyside.webp",
        "imageDesktop": "/images/sunnyside-desktop.webp",
        "imageMobile": "/images/sunnyside-mobile.webp",
        "alt": "interface du site Sunnyside agence",
        "title": "Sunnyside Agency",
        "git": "https://github.com/Flow2510/Sunnyside-agency-landing-page",
        "tags": ["HTML", "CSS", "JavaScript", "Responsive", "LandingPage", "FrontendMentor"],
        "titleDescription": "Description",
        "description": "Le projet Sunnyside Agency est un challenge Frontend Mentor visant à recréer la page d’accueil d’une agence de communication. \nL’objectif est de reproduire fidèlement la maquette fournie en utilisant HTML, CSS et JavaScript. \nLe projet met l’accent sur une mise en page responsive et fluide grâce à Flexbox et CSS Grid, ainsi que sur la gestion du menu mobile et des effets d’animation au scroll. \nCette réalisation permet de renforcer les compétences en intégration moderne, en gestion du responsive design et en optimisation de l’expérience utilisateur sur tous les supports."
    },
    {
        "id": "loopstudios",
        "image": "/images/loopstudios.webp",
        "imageDesktop": "/images/loopstudios-desktop.webp",
        "imageMobile": "/images/loopstudios-mobile.webp",
        "alt": "interface du site loopstudios",
        "title": "Loopstudios",
        "git": "https://github.com/Flow2510/loopstudio",
        "tags": ["REACT", "SCSS", "Responsive", "Figma", "Openclassrooms"],
        "titleDescription": "Description",
        "description": "Loopstudios est une landing page moderne conçue pour une agence fictive spécialisée dans la création d’expériences en réalité virtuelle. \nLe projet met en avant un design épuré et immersif, avec une mise en page entièrement responsive et des animations légères pour enrichir l’expérience utilisateur. \nRéalisé avec HTML, SCSS et JavaScript, il illustre une attention particulière portée à la structure du code, à la cohérence visuelle et à la finesse des transitions. \nInspiré d’un challenge Frontend Mentor, ce projet démontre la maîtrise des fondamentaux du front-end moderne et du design orienté expérience."
    },
    {
        "id": "REST Countries API",
        "image": "/images/restcountries.webp",
        "imageDesktop": "/images/restcountries-desktop.webp",
        "imageMobile": "/images/restcountries-mobile.webp",
        "alt": "logo de react",
        "title": "REST Countries API",
        "git": "https://github.com/Flow2510/REST-Countries",
        "tags": ["React", "API REST", "Fetch", "JavaScript", "Responsive", "DarkMode", "Routing", "FrontendMentor"],
        "titleDescription": "Description",
        "description": "Le projet REST Countries API est un challenge Frontend Mentor consistant à construire une application web interactive en React. \nL’objectif est d’afficher des données en temps réel depuis l’API REST Countries, tout en proposant une interface moderne et responsive. \nL’utilisateur peut rechercher un pays, filtrer par région, et consulter les détails (population, capitale, frontières, etc.). \nLe projet intègre également un mode sombre géré en JavaScript/React et une navigation entre les pages via React Router. \nCe projet met en avant la consommation d’API REST, la gestion de l’état avec React, la création de composants réutilisables et l’attention portée à l’UX/UI."
    }
]