[
    {
        "id": "extensionslist",
        "image": "/images/extensionslist.webp",
        "imageDesktop": "/images/extensionslist-desktop.webp",
        "imageMobile": "/images/extensionslist-mobile.webp",
        "alt": "logo de Extensions List",
        "altDesktop": "interface du site Extensions List sur un pc portable",
        "altMobile": "interface du site Extensions List sur un smartphone",
        "title": "Extensions List",
        "git": "https://github.com/Flow2510/Browser-extension-manager/",
        "tags": ["React", "JavaScript", "Responsive", "FrontendMentor"],
        "titleDescription": "Description",
        "description": "Le projet Browser Extension Manager est un défi Frontend Mentor visant à concevoir une interface web moderne permettant de gérer et promouvoir des extensions de navigateur. \nDéveloppé en React, il met l’accent sur une mise en page claire, esthétique et responsive, avec une expérience utilisateur fluide sur tous les écrans.\nL’objectif est de reproduire une page produit professionnelle, tout en perfectionnant la gestion des composants, du design system et des animations d’interface en React."
    },
    {
        "id": "weatherapp",
        "image": "/images/weatherapp.webp",
        "imageDesktop": "/images/weatherapp-desktop.webp",
        "imageMobile": "/images/weatherapp-mobile.webp",
        "alt": "logo de Weather App",
        "altDesktop": "interface du site Weather App sur un pc portable",
        "altMobile": "interface du site Weather App sur un smartphone",
        "title": "Weather App",
        "git": "https://github.com/Flow2510/Weather-Now",
        "page": "https://weathernowflow2510.netlify.app/",
        "tags": ["React", "API REST", "Fetch", "JavaScript", "Responsive", "FrontendMentor"],
        "titleDescription": "Description",
        "description": "Le projet Weather App est un défi Frontend Mentor consistant à concevoir une application météo interactive en React.\nL’objectif est d’afficher en temps réel les conditions et prévisions météorologiques grâce à l’API Open-Meteo, tout en offrant une interface moderne, claire et responsive.\nL’utilisateur peut rechercher une ville, consulter la température actuelle, les conditions météo détaillées et les prévisions des prochains jours."
    },
    {
        "id": "kasa",
        "image": "/images/Kasa.webp",
        "imageDesktop": "/images/kasa-desktop.webp",
        "imageMobile": "/images/kasa-mobile.webp",
        "altDesktop": "interface du site Kasa sur un pc portable",
        "altMobile": "interface du site Kasa sur un smartphone",
        "alt": "interface du site Kasa",
        "title": "Kasa",
        "git": "https://github.com/Flow2510/Kasa",
        "tags": ["REACT", "SCSS", "Responsive", "Figma", "Openclassrooms"],
        "titleDescription": "Description",
        "description": "Le projet Kasa consiste à développer une application front-end en React à partir d'une maquette Figma. \nL'application affiche des annonces immobilières dynamiques, fournit une page de détail par logement avec galerie d'images, tags, système de notation et sections déroulantes pour la description et les équipements. \nLe site est pensé mobile-first, respecte les règles d'accessibilité et utilise React Router pour le routage dynamique. \nCompétences mobilisées : découpage en composants réutilisables, gestion d'état, routage dynamique, intégration depuis une maquette et optimisation responsive."
    },
    {
        "id": "unsplashbox",
        "image": "/images/unsplashbox.webp",
        "imageDesktop": "/images/unsplashbox-desktop.webp",
        "imageMobile": "/images/unsplashbox-mobile.webp",
        "altDesktop": "interface du site unsplashbox sur un pc portable",
        "altMobile": "interface du site unsplashbox sur un smartphone",
        "alt": "interface du site unsplashbox",
        "title": "unsplashbox",
        "git": "https://github.com/Flow2510/unsplashbox",
        "tags": ["REACT", "SCSS", "Responsive", "API REST", "DevChallenges"],
        "titleDescription": "Description",
        "description": "Le projet Unsplash Collection consiste à développer une application front-end en React à partir d’un challenge DevChallenges. \nL’application permet de parcourir une collection d’images inspirée d’Unsplash, avec une interface fluide et responsive. Chaque image dispose d’une page dédiée affichant ses informations détaillées. \nLe site utilise React Router DOM pour le routage entre les pages et Sass pour la gestion du style et la création d’une interface moderne et maintenable. \nCompétences mobilisées : création de composants réutilisables, gestion du routage, stylisation avec Sass, respect des bonnes pratiques d’accessibilité et optimisation responsive."
    },
    {
        "id": "argentbank",
        "image": "/images/argentbank.webp",
        "imageDesktop": "/images/argentbank-desktop.webp",
        "imageMobile": "/images/argentbank-mobile.webp",
        "alt": "une plante pousse sur un tas de pièces",
        "altDesktop": "interface du site ArgentBank sur un pc portable",
        "altMobile": "interface du site ArgentBank sur un smartphone",
        "title": "ArgentBank",
        "git": "https://github.com/Flow2510/ArgentBank",
        "tags": ["REACT", "API REST", "SCSS", "Responsive", "Figma", "Openclassrooms"],
        "titleDescription": "Description",
        "description": "Le projet ArgentBank consiste à concevoir la partie front-end d'une application bancaire en React. \nL'objectif est d'intégrer un tableau de bord utilisateur permettant la consultation et la gestion de comptes à partir d'une API REST existante. \nLe projet met l'accent sur l'authentification, la gestion du state global avec Redux, et l'échange de données via des requêtes asynchrones. \nL'application comprend une page de connexion sécurisée, un profil utilisateur avec modification des informations, et une présentation des comptes. \nL'ensemble est réalisé selon une architecture modulaire et responsive, en respectant la maquette Figma fournie."
    },
    {
        "id": "Portfolio",
        "image": "/images/portfolio.webp",
        "imageDesktop": "/images/portfolio-desktop.webp",
        "imageMobile": "/images/portfolio-mobile.webp",
        "alt": "interface de mon site portfolio",
        "title": "Portfolio personnel",
        "altDesktop": "interface de mon portfolio sur un pc portable",
        "altMobile": "interface de mon portfolio sur un smartphone",
        "git": "https://github.com/Flow2510/portfolio2",
        "tags": ["React", "SCSS", "JavaScript", "Responsive", "ReactRouter", "UX/UI", "Animations", "Design"],
        "titleDescription": "Description",
        "description": "Mon site personnel a été conçu comme une vitrine professionnelle pour présenter mon parcours, mes réalisations et mes compétences en développement front-end. \nLe projet repose sur React pour la structure du contenu, React Router pour la navigation entre les pages, et SCSS pour une gestion claire et modulaire des styles."
    },
    {
        "id": "sunnyside",
        "image": "/images/sunnyside.webp",
        "imageDesktop": "/images/sunnyside-desktop.webp",
        "imageMobile": "/images/sunnyside-mobile.webp",
        "alt": "interface du site Sunnyside agence",
        "altDesktop": "interface du site Sunnyside sur un pc portable",
        "altMobile": "interface du site Sunnyside sur un smartphone",
        "title": "Sunnyside Agency",
        "git": "https://github.com/Flow2510/Sunnyside-agency-landing-page",
        "tags": ["HTML", "CSS", "JavaScript", "Responsive", "LandingPage", "FrontendMentor"],
        "titleDescription": "Description",
        "description": "Le projet Sunnyside Agency est un challenge Frontend Mentor visant à recréer la page d’accueil d’une agence de communication. \nL’objectif est de reproduire fidèlement la maquette fournie en utilisant HTML, CSS et JavaScript. \nLe projet met l’accent sur une mise en page responsive et fluide grâce à Flexbox et CSS Grid, ainsi que sur la gestion du menu mobile et des effets d’animation au scroll. \nCette réalisation permet de renforcer les compétences en intégration moderne, en gestion du responsive design et en optimisation de l’expérience utilisateur sur tous les supports."
    },
    {
        "id": "loopstudios",
        "image": "/images/loopstudios.webp",
        "imageDesktop": "/images/loopstudios-desktop.webp",
        "imageMobile": "/images/loopstudios-mobile.webp",
        "alt": "interface du site loopstudios",
        "altDesktop": "interface du site Loopstudios sur un pc portable",
        "altMobile": "interface du site Loopstudios sur un smartphone",
        "title": "Loopstudios",
        "git": "https://github.com/Flow2510/loopstudio",
        "page": "https://loopstudios2510.netlify.app/",
        "tags": ["REACT", "SCSS", "Responsive", "Figma", "Openclassrooms"],
        "titleDescription": "Description",
        "description": "Loopstudios est une landing page moderne conçue pour une agence fictive spécialisée dans la création d’expériences en réalité virtuelle. \nLe projet met en avant un design épuré et immersif, avec une mise en page entièrement responsive et des animations légères pour enrichir l’expérience utilisateur. \nRéalisé avec HTML, SCSS et JavaScript, il illustre une attention particulière portée à la structure du code, à la cohérence visuelle et à la finesse des transitions. \nInspiré d’un challenge Frontend Mentor, ce projet démontre la maîtrise des fondamentaux du front-end moderne et du design orienté expérience."
    },
    {
        "id": "REST Countries API",
        "image": "/images/restcountries.webp",
        "imageDesktop": "/images/restcountries-desktop.webp",
        "imageMobile": "/images/restcountries-mobile.webp",
        "alt": "logo de react",
        "altDesktop": "interface du site Rest Countries API sur un pc portable",
        "altMobile": "interface du site Rest Countries API sur un smartphone",
        "title": "REST Countries API",
        "git": "https://github.com/Flow2510/REST-Countries",
        "page": "https://restapicountriesflow2510.netlify.app/",
        "tags": ["React", "API REST", "Fetch", "JavaScript", "Responsive", "DarkMode", "Routing", "FrontendMentor"],
        "titleDescription": "Description",
        "description": "Le projet REST Countries API est un challenge Frontend Mentor consistant à construire une application web interactive en React. \nL’objectif est d’afficher des données en temps réel depuis l’API REST Countries, tout en proposant une interface moderne et responsive. \nL’utilisateur peut rechercher un pays, filtrer par région, et consulter les détails (population, capitale, frontières, etc.). \nLe projet intègre également un mode sombre géré en JavaScript/React et une navigation entre les pages via React Router. \nCe projet met en avant la consommation d’API REST, la gestion de l’état avec React, la création de composants réutilisables et l’attention portée à l’UX/UI."
    },
    {
        "id": "Product List",
        "image": "/images/productcart.webp",
        "imageDesktop": "/images/productcart-desktop.webp",
        "imageMobile": "/images/productcart-mobile.webp",
        "alt": "un dessert",
        "altDesktop": "interface du site Product List sur un pc portable",
        "altMobile": "interface du site Product List sur un smartphone",
        "title": "Product List",
        "git": "https://github.com/Flow2510/Product-list",
        "page": "https://productlist-flow2510.netlify.app/",
        "tags": ["React", "SCSS", "Responsive", "FrontendMentor"],
        "titleDescription": "Description",
        "description": "Product Cart List est une interface moderne et interactive permettant de parcourir une sélection de desserts et de les ajouter à un panier dynamique. \nLe projet met l’accent sur l’expérience utilisateur à travers une gestion fluide des quantités, une mise à jour en temps réel du total et une interface claire et responsive. \nInspiré d’un challenge Frontend Mentor, ce projet démontre la capacité à structurer un code propre et maintenable tout en intégrant des comportements dynamiques et cohérents sur l’ensemble de l’application."
    },
    {
        "id": "alarado",
        "image": "/images/alarado.webp",
        "imageDesktop": "/images/alarado-desktop.webp",
        "imageMobile": "/images/alarado-mobile.webp",
        "altDesktop": "interface du site Alarado sur un pc portable",
        "altMobile": "interface du site Alarado sur un smartphone",
        "alt": "interface du site Alarado",
        "title": "Alarado",
        "git": "https://github.com/Flow2510/alarado",
        "tags": ["REACT", "SCSS", "Responsive", "DevChallenges"],
        "titleDescription": "Description",
        "description": "Le projet Alarado est un challenge DevChallenges.io consistant à reproduire une landing page moderne et responsive en React. \nL’objectif est de mettre en avant un design clair et professionnel, tout en assurant une structure de code propre et réutilisable. \nLe site intègre un système de thème clair/sombre géré via des variables sCSS et React, ainsi qu’une architecture SCSS modulable avec variables et mixins. \nCe projet met en avant la maîtrise de la structuration de composants React, la gestion de thèmes dynamiques, et l’application des bonnes pratiques d’intégration front-end."
    }    
]